In [1]:
print("hello world")

hello world

In [3]:
from pandas import Series,DataFrame
import pandas as pd
s=Series([100,'python','pandas'])
s

In [4]:
s.index

RangeIndex(start=0, stop=3, step=1)

In [6]:
s.values

array([100, 'python', 'pandas'], dtype=object)

In [8]:
s1=Series([100,'python','pandas'],index=['r0','r1','r2'])
s1

r0       100
r1    python
r2    pandas
dtype: object

In [9]:
s1.index

Index(['r0', 'r1', 'r2'], dtype='object')

In [10]:
s1['r1']

'python'

In [11]:
s[1]

'python'

In [12]:
sd=Series({'r0':100,'r1':'python'})
sd

r0       100
r1    python
dtype: object

In [13]:
s2=Series(sd,index=['r0','r1','r2'])
s2

r0       100
r1    python
r2       NaN
dtype: object

In [14]:
pd.isnull(s2)

r0    False
r1    False
r2     True
dtype: bool

In [15]:
pd.notnull(s2)

r0     True
r1     True
r2    False
dtype: bool

In [17]:
s3=Series([100,200,300])
s3[s3>100]

1    200
2    300
dtype: int64

In [18]:
s3

0    100
1    200
2    300
dtype: int64

DataFrame 是一种二维的数据结构,通过 columns 和 index 来确定一个主句的位置

In [5]:
data={'name':['google','facebook','alibaba'],'price':[100,200,300],'star':[
    10,8,9]}
df=DataFrame(data)
df

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>name</th>
      <th>price</th>
      <th>star</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>google</td>
      <td>100</td>
      <td>10</td>
    </tr>
    <tr>
      <th>1</th>
      <td>facebook</td>
      <td>200</td>
      <td>8</td>
    </tr>
    <tr>
      <th>2</th>
      <td>alibaba</td>
      <td>300</td>
      <td>9</td>
    </tr>
  </tbody>
</table>
</div>

In [6]:
data1=DataFrame(data=data,columns=['name','price','star','trend'])
data1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>name</th>
      <th>price</th>
      <th>star</th>
      <th>trend</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>google</td>
      <td>100</td>
      <td>10</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>facebook</td>
      <td>200</td>
      <td>8</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>alibaba</td>
      <td>300</td>
      <td>9</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [8]:
data1.columns

Index(['name', 'price', 'star', 'trend'], dtype='object')

In [9]:
data1['price']

0    100
1    200
2    300
Name: price, dtype: int64

In [10]:
type(data1['price'])

pandas.core.series.Series

In [7]:
data1['price'][1]

200

In [9]:
data['price'][1]=500
data1

<div>
<style scoped>
    .dataframe tbody tr th:only-of-type {
        vertical-align: middle;
    }

    .dataframe tbody tr th {
        vertical-align: top;
    }

    .dataframe thead th {
        text-align: right;
    }
</style>
<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>name</th>
      <th>price</th>
      <th>star</th>
      <th>trend</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>google</td>
      <td>100</td>
      <td>10</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>1</th>
      <td>facebook</td>
      <td>500</td>
      <td>8</td>
      <td>NaN</td>
    </tr>
    <tr>
      <th>2</th>
      <td>alibaba</td>
      <td>300</td>
      <td>9</td>
      <td>NaN</td>
    </tr>
  </tbody>
</table>
</div>

In [15]:
from pandas_datareader import data, wb
sym='BABA'
finace=pandas.io.data.Dat

FileNotFoundError: [Errno 2] No such file or directory: './marks.csv'